<!-- dflook/terraform-github-actions {"workspace":"default","backend":"6b6c9851064a4908ba5d64abd5534a2fab053faa2417ea303efffb8fb6b6cabb","backend_type":"artifactory"} -->
Terraform plan in __terraform/keycloak__
<details>
<summary>Plan: 29 to add, 3 to change, 34 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.keycloak_dev.module.bceidbasic.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = "**********"
    }

  # module.keycloak_dev.module.bceidbasic.keycloak_authentication_execution_config.browser_identity_provider_redirector_config must be replaced
-/+ resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      ~ execution_id = "************************************" -> (known after apply) # forces replacement
      ~ id           = "************************************" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidboth.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = "*********"
    }

  # module.keycloak_dev.module.bceidboth.keycloak_authentication_execution_config.browser_identity_provider_redirector_config must be replaced
-/+ resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      ~ execution_id = "************************************" -> (known after apply) # forces replacement
      ~ id           = "************************************" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bceidbusiness.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = "*************"
    }

  # module.keycloak_dev.module.bceidbusiness.keycloak_authentication_execution_config.browser_identity_provider_redirector_config must be replaced
-/+ resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      ~ execution_id = "************************************" -> (known after apply) # forces replacement
      ~ id           = "************************************" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.data.keycloak_authentication_execution.browser_identity_provider_redirector will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_authentication_execution" "browser_identity_provider_redirector" {
      + id                = (known after apply)
      + parent_flow_alias = "browser"
      + provider_id       = "****************************"
      + realm_id          = (known after apply)
    }

  # module.keycloak_dev.module.bcsc.keycloak_authentication_execution_config.browser_identity_provider_redirector_config must be replaced
-/+ resource "keycloak_authentication_execution_config" "browser_identity_provider_redirector_config" {
      ~ execution_id = "************************************" -> (known after apply) # forces replacement
      ~ id           = "************************************" -> (known after apply)
      ~ realm_id     = "*****" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_displayname must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_displayname" {
      ~ id                       = "************************************" -> (known after apply)
        name                     = "display_name"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_email must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_email" {
      ~ id                       = "************************************" -> (known after apply)
        name                     = "email"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_firstname must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_firstname" {
      ~ id                       = "************************************" -> (known after apply)
        name                     = "first_name"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_idir_user_guid must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_idir_user_guid" {
      ~ id                       = "************************************" -> (known after apply)
        name                     = "idir_user_guid"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_idir_username must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_idir_username" {
      ~ id                       = "************************************" -> (known after apply)
        name                     = "idir_username"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_custom_identity_provider_mapper.bcsc_lastname must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_lastname" {
      ~ id                       = "************************************" -> (known after apply)
        name                     = "last_name"
      ~ realm                    = "bcsc1" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.keycloak_openid_client_scope.idp_scope must be replaced
-/+ resource "keycloak_openid_client_scope" "idp_scope" {
      ~ id                     = "************************************" -> (known after apply)
        name                   = "bcsc"
      ~ realm_id               = "*****" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "***************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "****************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "***************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "*******************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "**********"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_openid_client.clients["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "clients" {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "**************"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_realm.master will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "keycloak_realm" "master" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + account_theme                            = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + admin_theme                              = (known after apply)
      + attributes                               = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + default_default_client_scopes            = (known after apply)
      + default_optional_client_scopes           = (known after apply)
      + default_signature_algorithm              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + display_name                             = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + email_theme                              = (known after apply)
      + enabled                                  = (known after apply)
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_theme                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = (known after apply)
      + password_policy                          = (known after apply)
      + realm                                    = "master"
      + refresh_token_max_reuse                  = (known after apply)
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = (known after apply)
      + ssl_required                             = (known after apply)
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = (known after apply)
      + verify_email                             = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_authorization["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_authorization" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_clients["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_clients" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_events["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_events" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_identity_providers["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_identity_providers" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_realm["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_realm" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["azureidir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["bceidbasic"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["bceidboth"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["bceidbusiness"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["idir"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["master"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.data.keycloak_role.view_users["standard"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "view_users" {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_openid_client.viewer_service_account must be replaced
-/+ resource "keycloak_openid_client" "viewer_service_account" {
      - backchannel_logout_revoke_offline_sessions = false -> null
      ~ client_secret                              = (sensitive value)
      - extra_config                               = {} -> null
      ~ id                                         = "************************************" -> (known after apply)
        name                                       = "viwer-cli"
      ~ realm_id                                   = "******" -> (known after apply) # forces replacement
      + resource_server_id                         = (known after apply)
      ~ service_account_user_id                    = "************************************" -> (known after apply)
      - valid_redirect_uris                        = [] -> null
      - web_origins                                = [] -> null
        # (17 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_openid_client_service_account_realm_role.viewer_service_account_viewer_role must be replaced
-/+ resource "keycloak_openid_client_service_account_realm_role" "viewer_service_account_viewer_role" {
      ~ id                      = "*************************************************************************" -> (known after apply)
      ~ realm_id                = "******" -> (known after apply) # forces replacement
      ~ service_account_user_id = "************************************" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.master_viewer_role.keycloak_role.viewer must be replaced
-/+ resource "keycloak_role" "viewer" {
      - attributes      = {} -> null
      ~ composite_roles = [
          - "06ec1691-061a-49bd-8997-d66ee6e97ac3",
          - "0e14026c-ecb0-4727-a288-5ee083907a2b",
          - "0f5130ca-be0e-43c6-b923-4400a37f4dba",
          - "10a13789-48da-4769-b45d-c188e9a3fb8a",
          - "124ada00-627a-4561-a8a6-0f5af2b46ae7",
          - "1330209f-28f4-457f-9d2d-082fc67f40d6",
          - "177f8179-6866-4df7-ac41-45d1f35a92e1",
          - "181adb99-5f90-4b26-8cc8-e90e51158518",
          - "1adeb478-dee9-4e79-832d-35cee16a90f0",
          - "1d95dcc3-227e-4c2b-9a57-efb4b16b3519",
          - "38ef2f16-2913-4fd4-8958-e85d569ccb2e",
          - "4546e51b-8ccb-48b9-85e7-091ba37fc6af",
          - "4979cead-6ab4-4503-b696-18f5037031a4",
          - "4b28219a-1ffa-4cbe-9931-5e3833ec1959",
          - "4e379266-ae1f-4a90-a4b0-7fc00828ecf2",
          - "4e596f3e-d1f5-4046-b36a-3278553a1c1f",
          - "65131363-9986-4144-b8bc-b3f07261549a",
          - "65ab9393-bf34-4e6c-be8b-657736b1f339",
          - "6c888bac-a8b0-4099-9a6a-78c494f71dbd",
          - "7760db64-1068-429c-9833-44ac1e5ee4d1",
          - "7afa503e-deef-4180-a256-930b3be84b49",
          - "7d6fc9df-a9b5-4cd3-8a2b-29a4d4b3694d",
          - "83ca8807-7b4d-451f-a65e-6388d121a3f3",
          - "8ac1632e-b598-4dd5-9a45-7e7bebb4f8f3",
          - "8f092661-4c53-43e4-bfb7-64f4f8c43d3b",
          - "9b1c6766-137e-4088-9fb2-019955e35244",
          - "a0aee34b-2a47-4cf7-9ed9-ca200f0b640c",
          - "a0e0d62e-f445-444b-b8a7-216bb668a052",
          - "a465c19c-819c-4242-a3e5-59d65ea729ed",
          - "b004db88-4127-4133-80ce-fed9a2556a1c",
          - "bde3ec85-e92a-4542-a1f6-34cc2e369f8f",
          - "befa61a9-32e8-44a1-93cb-625fb70ef6f4",
          - "c4e6f47b-3b6d-4df1-9057-ee314160c282",
          - "c6834209-61ef-44d4-84fc-76a3db869c8a",
          - "cb8443d5-4909-4999-a943-6bd35b131ed1",
          - "cd4466cd-54bc-49e2-a19f-c4c054da2466",
          - "e1feebc9-cef0-4996-94bb-3ab6af543005",
          - "e772ee42-5b82-4951-b6ab-67c7d9508a85",
          - "e79c1833-e255-4c01-91d5-41dc1e69cbe3",
          - "ec345cb2-699a-443b-a20a-0395db729106",
          - "ed2fe752-ab07-45da-b526-1fa71487c867",
          - "f1f0f62e-cbb8-43a9-9be8-7c057bf5cfb1",
        ] -> (known after apply)
      ~ id              = "************************************" -> (known after apply)
        name            = "viewer"
      ~ realm_id        = "******" -> (known after apply) # forces replacement
    }

  # module.keycloak_dev.module.standard.keycloak_custom_identity_provider_mapper.bcsc_username must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "bcsc_username" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "bcsc" # forces replacement
        name                     = "username"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.bcsc_idp.keycloak_oidc_identity_provider.this must be replaced
-/+ resource "keycloak_oidc_identity_provider" "this" {
      ~ authorization_url                       = "https://idtest.gov.bc.ca/login/oidc/authorize" -> "https://keycloak.freshworks.club/auth/realms/social-sector-portal-test/protocol/openid-connect/auth"
      ~ client_id                               = "****************************************************"
      ~ id                                      = "****" -> (known after apply)
      ~ internal_id                             = "************************************" -> (known after apply)
      - jwks_url                                = "https://idtest.gov.bc.ca/oauth2/jwk" -> null
      ~ realm                                   = "bcsc1" -> (known after apply) # forces replacement
      ~ token_url                               = "https://idtest.gov.bc.ca/oauth2/token" -> "https://keycloak.freshworks.club/auth/realms/social-sector-portal-test/protocol/openid-connect/token"
      ~ user_info_url                           = "https://idtest.gov.bc.ca/oauth2/userinfo" -> "https://keycloak.freshworks.club/auth/realms/social-sector-portal-test/protocol/openid-connect/userinfo"
        # (21 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.realm.keycloak_realm.this must be replaced
-/+ resource "keycloak_realm" "this" {
      ~ access_code_lifespan                     = "1m0s" -> "1m"
      ~ access_code_lifespan_login               = "30m0s" -> "30m"
      ~ access_code_lifespan_user_action         = "5m0s" -> "5m"
      ~ access_token_lifespan                    = "************"
      ~ access_token_lifespan_for_implicit_flow  = "**************"
      ~ action_token_generated_by_admin_lifespan = "****************"
      ~ action_token_generated_by_user_lifespan  = "************"
      - attributes                               = {} -> null
      ~ browser_flow                             = "browser" -> (known after apply)
      ~ client_authentication_flow               = "clients" -> (known after apply)
      ~ client_session_idle_timeout              = "**" -> (known after apply)
      ~ client_session_max_lifespan              = "0s" -> (known after apply)
      - default_default_client_scopes            = [] -> null
      - default_optional_client_scopes           = [] -> null
      ~ direct_grant_flow                        = "direct grant" -> (known after apply)
      ~ display_name                             = "bcsc1" -> "bcsc"
      ~ display_name_html                        = "<b>bcsc1</b>" -> "<b>bcsc</b>"
      ~ docker_authentication_flow               = "docker auth" -> (known after apply)
      ~ edit_username_allowed                    = false -> (known after apply)
      ~ id                                       = "*****" -> (known after apply)
      ~ internal_id                              = "*****" -> (known after apply)
      ~ oauth2_device_code_lifespan              = "*****" -> (known after apply)
      ~ oauth2_device_polling_interval           = 5 -> (known after apply)
      ~ offline_session_idle_timeout             = "******************"
      ~ offline_session_max_lifespan             = "1440h0m0s" -> (known after apply)
      ~ realm                                    = "bcsc1" -> "bcsc" # forces replacement
      ~ registration_allowed                     = false -> (known after apply)
      ~ registration_email_as_username           = false -> (known after apply)
      ~ registration_flow                        = "registration" -> (known after apply)
      ~ remember_me                              = false -> (known after apply)
      ~ reset_credentials_flow                   = "reset credentials" -> (known after apply)
      ~ reset_password_allowed                   = false -> (known after apply)
      ~ sso_session_idle_timeout                 = "**************"
      ~ sso_session_idle_timeout_remember_me     = "**" -> (known after apply)
      ~ sso_session_max_lifespan                 = "10h0m0s" -> "10h"
      ~ sso_session_max_lifespan_remember_me     = "0s" -> (known after apply)
      ~ verify_email                             = false -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ otp_policy {
          ~ algorithm         = "HmacSHA1" -> (known after apply)
          ~ digits            = 6 -> (known after apply)
          ~ initial_counter   = 0 -> (known after apply)
          ~ look_ahead_window = 1 -> (known after apply)
          ~ period            = 30 -> (known after apply)
          ~ type              = "totp" -> (known after apply)
        }

      ~ web_authn_passwordless_policy {
          ~ acceptable_aaguids                = [] -> (known after apply)
          ~ attestation_conveyance_preference = "not specified" -> (known after apply)
          ~ authenticator_attachment          = "not specified" -> (known after apply)
          ~ avoid_same_authenticator_register = false -> (known after apply)
          ~ create_timeout                    = 0 -> (known after apply)
          ~ relying_party_entity_name         = "keycloak" -> (known after apply)
          + relying_party_id                  = (known after apply)
          ~ require_resident_key              = "*************" -> (known after apply)
          ~ signature_algorithms              = [
              - "ES256",
            ] -> (known after apply)
          ~ user_verification_requirement     = "not specified" -> (known after apply)
        }

      ~ web_authn_policy {
          ~ acceptable_aaguids                = [] -> (known after apply)
          ~ attestation_conveyance_preference = "not specified" -> (known after apply)
          ~ authenticator_attachment          = "not specified" -> (known after apply)
          ~ avoid_same_authenticator_register = false -> (known after apply)
          ~ create_timeout                    = 0 -> (known after apply)
          ~ relying_party_entity_name         = "keycloak" -> (known after apply)
          + relying_party_id                  = (known after apply)
          ~ require_resident_key              = "*************" -> (known after apply)
          ~ signature_algorithms              = [
              - "ES256",
            ] -> (known after apply)
          ~ user_verification_requirement     = "not specified" -> (known after apply)
        }
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.keycloak_openid_client.this must be replaced
-/+ resource "keycloak_openid_client" "this" {
      - backchannel_logout_revoke_offline_sessions = false -> null
      ~ client_secret                              = (sensitive value)
      - extra_config                               = {} -> null
      ~ id                                         = "************************************" -> (known after apply)
        name                                       = "standard-realm"
      ~ realm_id                                   = "*****" -> (known after apply) # forces replacement
      + resource_server_id                         = (known after apply)
      + service_account_user_id                    = (known after apply)
      ~ valid_redirect_uris                        = [
          + "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/bcsc/endpoint",
          - "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/standard/broker/bcsc1/endpoint",
        ]
      - web_origins                                = [] -> null
        # (17 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.keycloak_openid_client_default_scopes.client_default_scopes must be replaced
-/+ resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      ~ client_id      = "************************************" -> (known after apply) # forces replacement
      ~ id             = "******************************************" -> (known after apply)
      ~ realm_id       = "*****" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.keycloak_openid_client_optional_scopes.client_optional_scopes must be replaced
-/+ resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "******************************************" -> (known after apply)
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp.keycloak_oidc_identity_provider.this must be replaced
-/+ resource "keycloak_oidc_identity_provider" "this" {
      ~ alias                                   = "bcsc1" -> "bcsc" # forces replacement
      ~ authorization_url                       = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc1/protocol/openid-connect/auth" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc/protocol/openid-connect/auth"
      ~ client_secret                           = (sensitive value)
      ~ display_name                            = "bcsc1" -> "bcsc"
      ~ id                                      = "*****" -> (known after apply)
      ~ internal_id                             = "************************************" -> (known after apply)
      ~ jwks_url                                = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc1/protocol/openid-connect/certs" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc/protocol/openid-connect/certs"
      ~ token_url                               = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc1/protocol/openid-connect/token" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc/protocol/openid-connect/token"
      ~ user_info_url                           = "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc1/protocol/openid-connect/userinfo" -> "https://social-sector-access-gateway-dev.apps.silver.devops.gov.bc.ca/realms/bcsc/protocol/openid-connect/userinfo"
        # (23 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_business_guid"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "bcsc" # forces replacement
        name                     = "bceid_business_guid"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_business_name"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "bcsc" # forces replacement
        name                     = "bceid_business_name"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_user_guid"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "bcsc" # forces replacement
        name                     = "bceid_user_guid"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["bceid_username"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "bcsc" # forces replacement
        name                     = "bceid_username"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_idp_mappers.keycloak_custom_identity_provider_mapper.this["display_name"] must be replaced
-/+ resource "keycloak_custom_identity_provider_mapper" "this" {
      ~ id                       = "************************************" -> (known after apply)
      ~ identity_provider_alias  = "bcsc1" -> "bcsc" # forces replacement
        name                     = "display_name"
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard.module.bcsc_scope_mappers.keycloak_openid_client_scope.this will be updated in-place
  ~ resource "keycloak_openid_client_scope" "this" {
      ~ description            = "bcsc1 idp client scope" -> "bcsc idp client scope"
        id                     = "3d1d9601-9eae-4067-ad93-e8232d0de95c"
      ~ name                   = "bcsc1" -> "bcsc"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.standard_clients.module.demo-app-1-5-31-2477.keycloak_generic_client_protocol_mapper.access_token_aud will be destroyed
  # (because keycloak_generic_client_protocol_mapper.access_token_aud is not in configuration)
  - resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      - client_id       = "964536b8-fd89-4a03-a14a-e8275c700515" -> null
      - config          = {
          - "access.token.claim"       = "****"
          - "id.token.claim"           = "*****"
          - "included.client.audience" = "demo-app-1-5-31-2477"
        } -> null
      - id              = "d139f7c9-eb3c-4dee-a4b6-a24b5b816d38" -> null
      - name            = "access_token_aud" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-audience-mapper" -> null
      - realm_id        = "standard" -> null
    }

  # module.keycloak_dev.module.standard_clients.module.demo-app-1-5-31-2477.keycloak_generic_client_protocol_mapper.client_roles_mapper will be destroyed
  # (because keycloak_generic_client_protocol_mapper.client_roles_mapper is not in configuration)
  - resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      - client_id       = "964536b8-fd89-4a03-a14a-e8275c700515" -> null
      - config          = {
          - "access.token.claim"                   = "****"
          - "claim.name"                           = "client_roles"
          - "id.token.claim"                       = "****"
          - "jsonType.label"                       = "String"
          - "multivalued"                          = "true"
          - "userinfo.token.claim"                 = "****"
          - "usermodel.clientRoleMapping.clientId" = "demo-app-1-5-31-2477"
        } -> null
      - id              = "9186983d-ffd0-4f00-b3e0-ea1811591613" -> null
      - name            = "client_roles" -> null
      - protocol        = "openid-connect" -> null
      - protocol_mapper = "oidc-usermodel-client-role-mapper" -> null
      - realm_id        = "standard" -> null
    }

  # module.keycloak_dev.module.standard_clients.module.demo-app-1-5-31-2477.keycloak_openid_client.this will be destroyed
  # (because keycloak_openid_client.this is not in configuration)
  - resource "keycloak_openid_client" "this" {
      - access_type                                = "CONFIDENTIAL" -> null
      - backchannel_logout_revoke_offline_sessions = false -> null
      - backchannel_logout_session_required        = true -> null
      - client_authenticator_type                  = "client-secret" -> null
      - client_id                                  = "demo-app-1-5-31-2477" -> null
      - client_secret                              = (sensitive value)
      - consent_required                           = false -> null
      - description                                = "Social Sector Access Portal App 1" -> null
      - direct_access_grants_enabled               = false -> null
      - display_on_consent_screen                  = false -> null
      - enabled                                    = true -> null
      - exclude_session_state_from_auth_response   = false -> null
      - extra_config                               = {} -> null
      - frontchannel_logout_enabled                = false -> null
      - full_scope_allowed                         = false -> null
      - id                                         = "964536b8-fd89-4a03-a14a-e8275c700515" -> null
      - implicit_flow_enabled                      = false -> null
      - name                                       = "demo-app-1-5-31-2477" -> null
      - oauth2_device_authorization_grant_enabled  = false -> null
      - realm_id                                   = "standard" -> null
      - service_accounts_enabled                   = false -> null
      - standard_flow_enabled                      = true -> null
      - use_refresh_tokens                         = true -> null
      - use_refresh_tokens_client_credentials      = false -> null
      - valid_redirect_uris                        = [
          - "https://demo-app-1.apps.silver.devops.gov.bc.ca/*",
        ] -> null
      - web_origins                                = [
          - "+",
          - "https://demo-app-1.apps.silver.devops.gov.bc.ca/*",
        ] -> null

      - authentication_flow_binding_overrides {
          - browser_id = "d45416b0-4852-429c-aeb9-a42b3887a96e" -> null
        }
    }

  # module.keycloak_dev.module.standard_clients.module.demo-app-1-5-31-2477.keycloak_openid_client_default_scopes.idp_scopes will be destroyed
  # (because keycloak_openid_client_default_scopes.idp_scopes is not in configuration)
  - resource "keycloak_openid_client_default_scopes" "idp_scopes" {
      - client_id      = "964536b8-fd89-4a03-a14a-e8275c700515" -> null
      - default_scopes = [
          - "bceidbasic",
          - "bceidboth",
          - "bceidbusiness",
          - "bcsc1",
          - "common",
          - "email",
          - "idir",
          - "profile",
        ] -> null
      - id             = "standard/964536b8-fd89-4a03-a14a-e8275c700515" -> null
      - realm_id       = "standard" -> null
    }

  # module.keycloak_dev.module.standard_clients.module.demo-app-1-5-31-2477.keycloak_openid_client_optional_scopes.client_optional_scopes will be destroyed
  # (because keycloak_openid_client_optional_scopes.client_optional_scopes is not in configuration)
  - resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      - client_id       = "964536b8-fd89-4a03-a14a-e8275c700515" -> null
      - id              = "standard/964536b8-fd89-4a03-a14a-e8275c700515" -> null
      - optional_scopes = [
          - "offline_access",
        ] -> null
      - realm_id        = "standard" -> null
    }

  # module.keycloak_dev.module.standard_clients.module.demo-testing-5-16-3644.keycloak_openid_client.this will be updated in-place
  ~ resource "keycloak_openid_client" "this" {
        id                                         = "12d7da07-cb68-4997-9a25-5ba6f5b0898a"
        name                                       = "demo-testing-5-16-3644"
      ~ web_origins                                = [
          - "http://localhost:3000",
          + "http://localhost:3000*",
            # (1 unchanged element hidden)
        ]
        # (23 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.keycloak_dev.module.standard_clients.module.demo-testing-5-16-3644.keycloak_openid_client_default_scopes.idp_scopes will be updated in-place
  ~ resource "keycloak_openid_client_default_scopes" "idp_scopes" {
      ~ default_scopes = [
          + "bcsc",
          - "bcsc1",
            # (7 unchanged elements hidden)
        ]
        id             = "standard/12d7da07-cb68-4997-9a25-5ba6f5b0898a"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["display_name"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "display_name"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_user_guid"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "idir_user_guid"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.bcsc.module.standard_client.module.client_mappers.keycloak_generic_client_protocol_mapper.this["idir_username"] must be replaced
-/+ resource "keycloak_generic_client_protocol_mapper" "this" {
      ~ client_id       = "************************************" -> (known after apply) # forces replacement
      ~ id              = "************************************" -> (known after apply)
        name            = "idir_username"
      ~ realm_id        = "*****" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

Plan: 29 to add, 3 to change, 34 to destroy.
```
</details>

:memo: Plan generated in [Runs KeyCloak terraform plan #13](https://github.com/bcgov/social-access-portal/actions/runs/2424331487)